ССЫЛКА НА ИСТОЧНИК ЗАДАЧ: https://karpov.courses/simulator-sql

<b>Задача 1</b>

Выведите все записи из таблицы products.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT *
FROM products as p

<b>Задача 2</b>

Выведите все записи из таблицы products, отсортировав их по наименованиям товаров в алфавитном порядке, т.е. по возрастанию.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT *
FROM products as p
ORDER BY p.name

<b>Задача 3</b>

Отсортируйте таблицу courier_actions сначала по колонке courier_id по возрастанию id курьера, потом по колонке action, а затем по колонке time, но уже по убыванию — от самого последнего действия к самому первому.

Добавьте в запрос оператор LIMIT и выведите только первые 1000 строк результирующей таблицы.

Поля в результирующей таблице: courier_id, order_id, action, time

In [ ]:
SELECT *
FROM courier_actions as ca
ORDER BY ca.courier_id, ca.action, ca.time DESC
LIMIT 1000

<b>Задача 4</b>

Используя операторы SELECT, FROM, ORDER BY и LIMIT, определите 5 самых дорогих товаров в таблице products, которые доставляет наш сервис. Выведите их наименования и цену.

Поля в результирующей таблице: name, price

In [ ]:
SELECT p.name, p.price
FROM products as p
ORDER BY p.price DESC
LIMIT 5

<b>Задача 5</b>

Повторите запрос из предыдущего задания, но теперь колонки name и price переименуйте соответственно в product_name и product_price.

Поля в результирующей таблице: product_name, product_price

In [ ]:
SELECT p.name as product_name, p.price as product_price
FROM products as p
ORDER BY p.price DESC
LIMIT 5

<b>Задача 6</b>

Используя операторы SELECT, FROM, ORDER BY и LIMIT, а также функцию LENGTH, определите товар с самым длинным названием в таблице products. Выведите его наименование, длину наименования в символах, а также цену этого товара. Колонку с длиной наименования в символах назовите name_length.

Поля в результирующей таблице: name, name_length, price

In [ ]:
SELECT p.name,
       length(p.name) as name_length,
       p.price
FROM   products as p
ORDER BY 2 desc
LIMIT 1

<b>Задача 7</b>

Примените последовательно функции UPPER и SPLIT_PART к колонке name и преобразуйте наименования товаров в таблице products так, чтобы от названий осталось только первое слово, записанное в верхнем регистре. Колонку с новым названием, состоящим из первого слова, назовите first_word.

В результат включите исходные наименования товаров, новые наименования из первого слова, а также цену товаров. Результат отсортируйте по возрастанию исходного наименования товара в колонке name.

Поля в результирующей таблице: name, first_word, price

In [ ]:
SELECT p.name,
       UPPER(SPLIT_PART(p.name, ' ', 1)) as first_word,
       p.price
FROM products as p
ORDER BY p.name

<b>Задача 8</b>

Измените тип колонки price из таблицы products на VARCHAR. Выведите колонки с наименованием товаров, ценой в исходном формате и ценой в формате VARCHAR. Новую колонку с ценой в новом формате назовите price_char.

Результат отсортируйте по возрастанию исходного наименования товара в колонке name. Количество выводимых записей не ограничивайте.

Поле в результирующей таблице: name, price, price_char

In [ ]:
SELECT p.name,
       p.price,
       p.price::VARCHAR as price_char
FROM products as p
ORDER BY p.name

<b>Задача 9</b>

Для первых 200 записей из таблицы orders выведите информацию в следующем виде (обратите внимание на пробелы):

Заказ № [id_заказа] создан [дата]

Полученную колонку назовите order_info.

In [ ]:
SELECT CONCAT('Заказ № ', o.order_id, ' создан ', o.creation_time::DATE) as order_info
FROM orders as o
LIMIT 200

<b>Задача 10</b>

Выведите id всех курьеров и их годы рождения из таблицы couriers.

Год рождения необходимо получить из колонки birth_date. Новую колонку с годом назовите birth_year. Результат отсортируйте сначала по убыванию года рождения курьера (т.е. от самых младших к самым старшим), затем по возрастанию id курьера.

Поля в результирующей таблице: courier_id, birth_year

In [ ]:
SELECT c.courier_id,
       DATE_PART('YEAR', c.birth_date) as birth_year
FROM couriers as c
ORDER BY 2 DESC, 1

<b>Задача 11</b>

Как и в предыдущем задании, снова выведите id всех курьеров и их годы рождения, только теперь к извлеченному году примените функцию COALESCE. Укажите параметры функции так, чтобы вместо NULL значений в результат попадало текстовое значение unknown. Названия полей оставьте прежними.

Отсортируйте итоговую таблицу сначала по убыванию года рождения курьера, затем по возрастанию id курьера.

Поля в результирующей таблице: courier_id, birth_year

In [ ]:
SELECT c.courier_id,
       COALESCE(DATE_PART('YEAR', c.birth_date)::varchar, 'unknown') as birth_year
FROM couriers as c
ORDER BY 2 DESC, 1

<b>Задача 12</b>

Давайте представим, что по какой-то необъяснимой причине мы вдруг решили в одночасье повысить цену всех товаров в таблице products на 5%.

Выведите id и наименования всех товаров, их старую и новую цену. Колонку со старой ценой назовите old_price, а колонку с новой — new_price.

Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
       p.price * 1.05 as new_price
FROM products as p
ORDER BY 4 DESC, 1

<b>Задача 13</b>

Вновь, как и в прошлом задании, повысьте цену всех товаров на 5%, только теперь к колонке с новой ценой примените функцию ROUND. Выведите id и наименования товаров, их старую цену, а также новую цену с округлением. Новую цену округлите до одного знака после запятой, но тип данных не меняйте.

Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
       ROUND(p.price * 1.05, 1) as new_price
FROM products as p
ORDER BY 4 DESC, 1

<b>Задача 14</b>

Повысьте цену на 5% только на те товары, цена которых превышает 100 рублей. Цену остальных товаров оставьте без изменений. Также не повышайте цену на икру, которая и так стоит 800 рублей. Выведите id и наименования всех товаров, их старую и новую цену. Цену округлять не нужно.

Результат отсортируйте сначала по убыванию новой цены, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
       CASE
       WHEN p.price > 100 AND p.name != 'икра' THEN p.price * 1.05
       ELSE p.price END as new_price
FROM products as p
ORDER BY 4 DESC, 1

<b>Задача 15</b>

Вычислите НДС каждого товара в таблице products и рассчитайте цену без учёта НДС. Выведите всю информацию о товарах, включая сумму налога и цену без его учёта. Колонки с суммой налога и ценой без НДС назовите соответственно tax и price_before_tax. Округлите значения в этих колонках до двух знаков после запятой.

Результат отсортируйте сначала по убыванию цены товара без учёта НДС, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, tax, price_before_tax

In [ ]:
SELECT p.product_id,
       p.name,
       p.price,
       ROUND(p.price / 120 * 20, 2) as tax,
       ROUND(p.price - p.price / 120 * 20, 2) as price_before_tax
FROM products as p
ORDER BY 5 DESC, 1

<b>Задача 16</b>

Напишите SQL-запрос к таблице products и выведите всю информацию о товарах, цена которых не превышает 100 рублей. Результат отсортируйте по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price
FROM products as p
WHERE p.price <= 100
ORDER BY 1

<b>Задача 17</b>

Отберите пользователей женского пола из таблицы users. Выведите только id этих пользователей. Результат отсортируйте по возрастанию id.

Добавьте в запрос оператор LIMIT и выведите только 1000 первых id из отсортированного списка.

Поле в результирующей таблице: user_id

In [ ]:
SELECT u.user_id
FROM users as u
WHERE sex = 'female'
ORDER BY 1
LIMIT 1000

<b>Задача 18</b>

Отберите из таблицы user_actions все действия пользователей по созданию заказов, которые были совершены ими после полуночи 6 сентября 2022 года. Выведите колонки с id пользователей, id созданных заказов и временем их создания.

Результат должен быть отсортирован по возрастанию id заказа.

Поля в результирующей таблице: user_id, order_id, time

In [ ]:
SELECT ua.user_id,
       ua.order_id,
       ua.time
FROM user_actions as ua
WHERE ua.action = 'create_order'
AND ua.time >= '2022-09-06'
ORDER BY ua.order_id

<b>Задача 19</b>

Назначьте скидку 20% на все товары из таблицы products и отберите те, цена на которые с учётом скидки превышает 100 рублей. Выведите id товаров, их наименования, прежнюю цену и новую цену с учётом скидки. <br>Колонку со старой ценой назовите old_price, с новой — new_price.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name, old_price, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price as old_price,
      (p.price * 0.8) as new_price
FROM products as p
WHERE p.price * 0.8 > 100
ORDER BY 1

<b>Задача 20</b>

Отберите из таблицы products все товары, названия которых либо начинаются со слова «чай», либо состоят из пяти символов. Выведите две колонки: id товаров и их наименования.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name

In [ ]:
SELECT p.product_id,
       p.name
FROM products as p
WHERE SPLIT_PART(p.name,' ', 1) = 'чай'
OR LENGTH(p.name) = 5
ORDER BY 1

<b>Задача 21</b>

Отберите из таблицы products все товары, содержащие в своём названии последовательность символов «чай» (без кавычек). Выведите две колонки: id продукта и его название.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name

In [ ]:
SELECT p.product_id,
       p.name
FROM products as p
WHERE p.name LIKE '%чай%'
ORDER BY 1

<b>Задача 22</b>

Выберите из таблицы products id и наименования только тех товаров, названия которых начинаются на букву «с» и содержат только одно слово.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name

In [ ]:
SELECT p.product_id,
       p.name
FROM products as p
WHERE p.name LIKE 'с%'
AND p.name NOT LIKE '% %'
ORDER BY 1

<b>Задача 23</b>

Составьте SQL-запрос, который выбирает из таблицы products все чаи стоимостью больше 60 рублей и вычисляет для них цену со скидкой 25%.

Скидку в % менеджер попросил указать в отдельном столбце в формате текста, то есть вот так: «25%» (без кавычек). Столбцы со скидкой и новой ценой назовите соответственно discount и new_price.

Также необходимо любым известным способом избавиться от «чайного гриба»: вряд ли менеджер имел в виду и его, когда ставил нам задачу.

Результат должен быть отсортирован по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, discount, new_price

In [ ]:
SELECT p.product_id,
       p.name,
       p.price,
       '25%' as discount,
       p.price * 0.75 as new_price
FROM products as p
WHERE p.price > 60
AND SPLIT_PART(p.name, ' ', 1) = 'чай'
ORDER BY 1

<b>Задача 24</b>

Из таблицы user_actions выведите всю информацию о действиях пользователей с id 170, 200 и 230 за период с 25 августа по 4 сентября 2022 года включительно. Результат отсортируйте по убыванию id заказа — то есть от самых поздних действий к самым первым.

Поля в результирующей таблице: user_id, order_id, action, time

In [ ]:
SELECT ua.user_id,
       ua.order_id,
       ua.action,
       ua.time
FROM user_actions as ua
WHERE ua.user_id IN (170, 200, 230)
AND ua.time BETWEEN '2022-08-25' AND '2022-09-05'
ORDER BY 2 DESC

<b>Задача 25</b>

Напишите SQL-запрос к таблице couriers и выведите всю информацию о курьерах, у которых не указан их день рождения.

Результат должен быть отсортирован по возрастанию id курьера.

Поля в результирующей таблице: birth_date, courier_id, sex

In [ ]:
SELECT c.birth_date,
       c.courier_id,
       c.sex
FROM couriers as c
WHERE c.birth_date IS NULL
ORDER BY 2

<b>Задача 26</b>

Определите id и даты рождения 50 самых молодых пользователей мужского пола из таблицы users. Не учитывайте тех пользователей, у которых не указана дата рождения.

Поле в результирующей таблице: user_id, birth_date

In [ ]:
SELECT u.user_id,
       u.birth_date
FROM users as u
WHERE u.birth_date IS NOT NULL
AND u.sex = 'male'
ORDER BY u.birth_date DESC
LIMIT 50;

<b>Задача 27</b>

Напишите SQL-запрос к таблице courier_actions, чтобы узнать id и время доставки последних 10 заказов, доставленных курьером с id 100.

Поля в результирующей таблице: order_id, time

In [ ]:
SELECT ca.order_id,
       ca.time
FROM courier_actions as ca
WHERE ca.courier_id = 100
AND ca.action = 'deliver_order'
ORDER BY 2 DESC
LIMIT 10;

<b>Задача 28</b>

Из таблицы user_actions получите id всех заказов, сделанных пользователями сервиса в августе 2022 года.

Результат отсортируйте по возрастанию id заказа.

Поле в результирующей таблице: order_id

In [ ]:
SELECT ua.order_id
FROM user_actions as ua
WHERE DATE_PART('year', ua.time) = 2022
AND DATE_PART('month', ua.time) = 8
AND ua.action = 'create_order'
ORDER BY 1;

<b>Задача 29</b>

Из таблицы couriers отберите id всех курьеров, родившихся в период с 1990 по 1995 год включительно.

Результат отсортируйте по возрастанию id курьера.

Поле в результирующей таблице: courier_id

In [ ]:
SELECT c.courier_id
FROM couriers as c
WHERE DATE_PART('year', c.birth_date) BETWEEN 1990 AND 1995
ORDER BY 1;

<b>Задача 30</b>

Из таблицы user_actions получите информацию о всех отменах заказов, которые пользователи совершали в течение августа 2022 года по средам с 12:00 до 15:59.

Результат отсортируйте по убыванию id отменённых заказов.

Поля в результирующей таблице: user_id, order_id, action, time

In [ ]:
SELECT ua.user_id,
       ua.order_id,
       ua.action,
       ua.time
FROM user_actions as ua
WHERE ua.action = 'cancel_order'
AND DATE_PART('year', ua.time) = 2022
AND DATE_PART('month', ua.time) = 8
AND DATE_PART('dow', ua.time) = 3
AND DATE_PART('hour', ua.time) BETWEEN 12 AND 15
AND DATE_PART('minute', ua.time) BETWEEN 0 AND 59
ORDER BY 2 DESC;

<b>Задача 31</b>

Как и в задаче из прошлого урока, вычислите НДС каждого товара в таблице products и рассчитайте цену без учёта НДС. Однако теперь примите во внимание, что для товаров из списка налог составляет 10%. Для остальных товаров НДС тот же — 20%.

Выведите всю информацию о товарах, включая сумму налога и цену без его учёта. Колонки с суммой налога и ценой без НДС назовите соответственно tax и price_before_tax. Округлите значения в этих колонках до двух знаков после запятой.

Результат отсортируйте сначала по убыванию цены товара без учёта НДС, затем по возрастанию id товара.

Поля в результирующей таблице: product_id, name, price, tax, price_before_tax

In [ ]:
SELECT p.product_id,
       p.name,
       p.price,
       CASE WHEN p.name IN ('сахар', 'сухарики', 'сушки',
                            'семечки', 'масло льняное', 'виноград',
                            'масло оливковое', 'арбуз', 'батон', 'йогурт',
                            'сливки', 'гречка', 'овсянка', 'макароны',
                            'баранина', 'апельсины', 'бублики', 'хлеб',
                            'горох', 'сметана', 'рыба копченая', 'мука',
                            'шпроты', 'сосиски', 'свинина', 'рис', 'масло кунжутное',
                            'сгущенка', 'ананас', 'говядина', 'соль', 'рыба вяленая',
                            'масло подсолнечное', 'яблоки', 'груши', 'лепешка', 'молоко',
                            'курица', 'лаваш', 'вафли', 'мандарины')
       THEN ROUND(p.price / 110 * 10, 2)
       ELSE ROUND(p.price / 120 * 20, 2) END as tax,
       CASE WHEN p.name in ('сахар', 'сухарики', 'сушки',
                            'семечки', 'масло льняное', 'виноград',
                            'масло оливковое', 'арбуз', 'батон', 'йогурт',
                            'сливки', 'гречка', 'овсянка', 'макароны',
                            'баранина', 'апельсины', 'бублики', 'хлеб',
                            'горох', 'сметана', 'рыба копченая', 'мука',
                            'шпроты', 'сосиски', 'свинина', 'рис', 'масло кунжутное',
                            'сгущенка', 'ананас', 'говядина', 'соль', 'рыба вяленая',
                            'масло подсолнечное', 'яблоки', 'груши', 'лепешка', 'молоко',
                            'курица', 'лаваш', 'вафли', 'мандарины')
       THEN ROUND(p.price - p.price / 110 * 10, 2)
       ELSE ROUND(p.price - p.price / 120 * 20, 2) END as price_before_tax
FROM   products as p
ORDER BY 5 desc, 1;

<b>Задача 32</b>

Выведите id всех уникальных пользователей из таблицы user_actions. Результат отсортируйте по возрастанию id.

Поле в результирующей таблице: user_id

In [ ]:
SELECT DISTINCT ua.user_id
FROM user_actions as ua
ORDER BY 1;

<b>Задача 33</b>

Примените DISTINCT сразу к двум колонкам таблицы courier_actions и отберите уникальные пары значений courier_id и order_id.

Результат отсортируйте сначала по возрастанию id курьера, затем по возрастанию id заказа.

Поля в результирующей таблице: courier_id, order_id

In [ ]:
SELECT DISTINCT ca.courier_id,
                ca.order_id
FROM courier_actions as ca
ORDER BY 1, 2;

<b>Задача 34</b>

Посчитайте максимальную и минимальную цены товаров в таблице products. Поля назовите соответственно max_price, min_price.

Поля в результирующей таблице: max_price, min_price

In [ ]:
SELECT MAX(p.price) as max_price,
       MIN(p.price) as min_price
FROM products as p;

<b>Задача 35</b>

Как вы помните, в таблице users у некоторых пользователей не были указаны их даты рождения.

Посчитайте в одном запросе количество всех записей в таблице и количество только тех записей, для которых в колонке birth_date указана дата рождения.

Колонку с общим числом записей назовите dates, а колонку с записями без пропусков — dates_not_null.

Поля в результирующей таблице: dates, dates_not_null

In [ ]:
SELECT COUNT(*) as dates,
       COUNT(u.birth_date) as dates_not_null
FROM users as u;

<b>Задача 36</b>

Посчитайте количество всех значений в колонке user_id в таблице user_actions, а также количество уникальных значений в этой колонке (т.е. количество уникальных пользователей сервиса).

Колонку с первым полученным значением назовите users, а колонку со вторым — unique_users.

Поля в результирующей таблице: users, unique_users

In [ ]:
SELECT COUNT(ua.user_id) as users,
       COUNT(DISTINCT ua.user_id) as unique_users
FROM user_actions as ua;

<b>Задача 37</b>

Посчитайте количество курьеров женского пола в таблице couriers. Полученный столбец с одним значением назовите couriers.

Поле в результирующей таблице: couriers

In [ ]:
SELECT COUNT(c.courier_id) as couriers
FROM   couriers as c
WHERE  c.sex = 'female'

<b>Задача 38</b>

Рассчитайте время, когда были совершены первая и последняя доставки заказов в таблице courier_actions.

Колонку с временем первой доставки назовите first_delivery, а колонку с временем последней — last_delivery.

Поля в результирующей таблице: first_delivery, last_delivery

In [ ]:
SELECT MIN(ca.time) as first_delivery,
       MAX(ca.time) as last_delivery
FROM   courier_actions as ca
WHERE  ca.action = 'deliver_order'

<b>Задача 39</b>

Представьте, что один из пользователей сервиса сделал заказ, в который вошли одна пачка сухариков, одна пачка чипсов и один энергетический напиток. Посчитайте стоимость такого заказа.

Колонку с рассчитанной стоимостью заказа назовите order_price.

Для расчётов используйте таблицу products.

Поле в результирующей таблице: order_price

In [ ]:
SELECT SUM(p.price) as order_price
FROM   products as p
WHERE  p.name IN ('сухарики', 'чипсы', 'энергетический напиток')

<b>Задача 40</b>

Посчитайте количество заказов в таблице orders с девятью и более товарами. Для этого воспользуйтесь функцией array_length, отфильтруйте данные по количеству товаров в заказе и проведите агрегацию. Полученный столбец назовите orders.

Поле в результирующей таблице: orders

In [ ]:
SELECT COUNT(o.order_id) as orders
FROM   orders as o
WHERE  ARRAY_LENGTH(o.product_ids, 1) >= 9

<b>Задача 41</b>

С помощью функции AGE и агрегирующей функции рассчитайте возраст самого молодого курьера мужского пола в таблице couriers.

Возраст выразите количеством лет, месяцев и дней (как в примере выше), переведя его в тип VARCHAR.

В качестве даты, относительно которой считать возраст курьеров, используйте свою текущую дату (либо не указывайте её на месте первого аргумента, как показано в примерах).

Полученную колонку со значением возраста назовите min_age.

Поле в результирующей таблице: min_age

In [ ]:
SELECT MIN(AGE(current_date, c.birth_date))::VARCHAR as min_age
FROM   couriers as c
WHERE  c.sex = 'male'

<b>Задача 42</b>

Посчитайте стоимость заказа, в котором будут три пачки сухариков, две пачки чипсов и один энергетический напиток.<br> Колонку с рассчитанной стоимостью заказа назовите order_price.

Для расчётов используйте таблицу products.

Поле в результирующей таблице: order_price

In [ ]:
SELECT SUM(CASE WHEN p.name = 'сухарики' THEN p.price * 3
                WHEN p.name = 'чипсы' THEN p.price * 2
                WHEN p.name = 'энергетический напиток' THEN p.price * 1
                else 0 end) as order_price
FROM   products as p

<b>Задача 43</b>

Рассчитайте среднюю цену товаров в таблице products, в названиях которых присутствуют слова «чай» или «кофе». <br>Любым известным способом исключите из расчёта товары содержащие «иван-чай» или «чайный гриб».

Среднюю цену округлите до двух знаков после запятой. Столбец с полученным значением назовите avg_price.

Поле в результирующей таблице: avg_price

In [ ]:
SELECT ROUND(AVG(p.price), 2) as avg_price
FROM   products as p
WHERE  (p.name LIKE '%чай%'
OR p.name LIKE '%кофе%')
AND (p.name NOT LIKE '%иван-чай%'
AND p.name NOT LIKE '%чайный гриб%')

<b>Задача 44</b>

Воспользуйтесь функцией AGE и рассчитайте разницу в возрасте между самым старым и самым молодым пользователями мужского пола в таблице users.

Разницу в возрасте выразите количеством лет, месяцев и дней, переведя её в тип VARCHAR.

Колонку с посчитанным значением назовите age_diff.

Поле в результирующей таблице: age_diff

In [ ]:
SELECT AGE(MAX(u.birth_date),MIN(u.birth_date))::VARCHAR as age_diff
FROM   users as u
WHERE  u.sex = 'male'

<b>Задача 45</b>

Рассчитайте среднее количество товаров в заказах из таблицы orders, которые пользователи оформляли по выходным дням (суббота и воскресенье) в течение всего времени работы сервиса.

Полученное значение округлите до двух знаков после запятой. Колонку с ним назовите avg_order_size.

Поле в результирующей таблице: avg_order_size

In [ ]:
SELECT ROUND(AVG(ARRAY_LENGTH(o.product_ids, 1)), 2) as avg_order_size
FROM   orders as o
WHERE  DATE_PART('dow', o.creation_time) IN (6, 0)

<b>Задача 46</b>

На основе данных в таблице user_actions посчитайте количество уникальных пользователей сервиса, количество уникальных заказов, поделите одно на другое и выясните, сколько заказов приходится на одного пользователя.

В результирующей таблице отразите все три значения — поля назовите соответственно unique_users, unique_orders, orders_per_user.

Показатель числа заказов на пользователя округлите до двух знаков после запятой.

Поля в результирующей таблице: unique_users, unique_orders, orders_per_user

In [ ]:
SELECT COUNT(DISTINCT ua.user_id) as unique_users,
       COUNT(DISTINCT ua.order_id) as unique_orders,
       ROUND(COUNT(DISTINCT ua.order_id)::DECIMAL / COUNT(DISTINCT ua.user_id),
             2) as orders_per_user
FROM   user_actions as ua

<b>Задача 47</b>

Посчитайте, сколько пользователей никогда не отменяли свой заказ. Для этого из общего числа всех уникальных пользователей отнимите число уникальных пользователей, которые хотя бы раз отменяли заказ. Подумайте, какое условие необходимо указать в FILTER, чтобы получить корректный результат.

Полученный столбец назовите users_count.

Поле в результирующей таблице: users_count

In [ ]:
SELECT COUNT(DISTINCT ua.user_id) - COUNT(DISTINCT ua.user_id) FILTER (WHERE ua.action = 'cancel_order') as users_count
FROM   user_actions as ua

<b>Задача 48</b>

Посчитайте общее количество заказов в таблице orders, количество заказов с пятью и более товарами и найдите долю заказов с пятью и более товарами в общем количестве заказов.

В результирующей таблице отразите все три значения — поля назовите соответственно orders, large_orders, large_orders_share.

Долю заказов с пятью и более товарами в общем количестве товаров округлите до двух знаков после запятой.

Поля в результирующей таблице: orders, large_orders, large_orders_share

In [ ]:
SELECT COUNT(o.order_id) as orders,
       COUNT(o.order_id)  FILTER (WHERE ARRAY_LENGTH(product_ids, 1) >= 5) as large_orders,
       ROUND(COUNT(o.order_id) FILTER (WHERE ARRAY_LENGTH(product_ids, 1) >= 5)::DECIMAL / COUNT(o.order_id),
             2) as large_orders_share
FROM   orders as o